unit UConsts;

{$mode ObjFPC}{$H+}

interface

uses
  Classes, SysUtils;

const
  APP_NAME       = 'KakeiBon';

  MSG_JP_000001  = '先にログインしてください';
  MSG_JP_000002  = '管理者ユーザ名は入力必須です。';
  MSG_JP_000003  = 'ユーザ名は入力必須です。';
  MSG_JP_000004  = 'パスワードは入力必須です。';
  MSG_JP_000005  = 'パスワードが一致していません。再度入力してください。';
  MSG_JP_000006  = 'さん、ようこそ ' + APP_NAME + ' へ';
  MSG_JP_000007  = '入力されたユーザ名とパスワードに合致するアカウントがありません。';
  MSG_JP_000008  = 'データベース名が取得できません。処理が続行できないためアップデータを終了します。';
  MSG_JP_000009  = 'そのユーザ名は既に登録されています。';
  MSG_JP_000010  = '入力した変更が取り消されました';
  MSG_JP_000011  = 'ユーザを削除するとこのユーザで登録した明細が見られなくなります。削除しますか？';
  MSG_JP_000012  = '削除処理を中断しました。';
  MSG_JP_000013  = 'データベースへアクセス中にエラーが発生しました。';
  MSG_JP_000014  = '管理者アカウントが変更されたためログアウトします。';
  MSG_JP_000015  = '編集できるユーザがありません。';
  MSG_JP_000016  = '削除できるユーザがありません。';
  MSG_JP_000017  = 'データベースが異常な状態です。' + APP_NAME + 'を終了するので最初からやり直してください。';
  MSG_JP_000018  = 'ユーザ名に '' (シングルクォート) は使えません。';
  MSG_JP_000019  = 'パスワードに '' (シングルクォート) は使えません。';
  MSG_JP_000020  = '変更がないため登録をスキップしました。';
  MSG_JP_000021  = 'アカウントの変更が完了しました。ログアウトします。';
  MSG_JP_000022  = '費目の登録で重複エラーが発生しました。';
  MSG_JP_000023  = '先にユーザ管理画面で通常使用するユーザを登録してください。';
  MSG_JP_000024  = '入出金登録を行う際は一般ユーザでログインしてください。';
  MSG_JP_000025  = '店名は入力必須です。';
  MSG_JP_000026  = '入出金区分は入力必須です。';
  MSG_JP_000027  = '出金元は入力必須です。';
  MSG_JP_000028  = '入金先は入力必須です。';
  MSG_JP_000029  = '合計金額は入力必須です。';
  MSG_JP_000030  = '編集する入出金がありません。';
  MSG_JP_000031  = 'アカウントの削除が完了しました。ログアウトします。';
  MSG_JP_000032  = 'メーカーが選択されていません。';
  MSG_JP_000033  = 'メーカーIDが取得できません';
  MSG_JP_000034  = '入力したら[Tabキー]で次の項目に移動してから保存してください';
  MSG_JP_000035  = '品名が選択されていません。';
  MSG_JP_000036  = '単位が選択されていません。';
  MSG_JP_000037  = '税区分が選択されていません。';
  MSG_JP_000038  = '数量は0以上を入力してください。';
  MSG_JP_000039  = '数字以外が入力されています。';
  MSG_JP_000040  = 'クエリを閉じることが出来ません。。';

  MSG_JP_000041  = 'データベースを更新します。';
  MSG_JP_000042  = 'データベースの更新が完了しました。';
  MSG_JP_000043  = 'データベースが更新できませんでした。';

implementation

end.

